import { DataType } from './types/dataTypes'

export const data: DataType = {
  category: [
    {
      ['world']: [
        {
          date: 1986,
          description:
            'Японский финансовый пузырь (яп. バブル景気 бабуру кэйки, досл. «экономика пузыря») — экономический пузырь в Японии с 1986 по 1991 год, характеризовавшийся многократным ростом цен на рынке недвижимости и фондовом рынке.',
        },
        {
          date: 1989,
          description:
            'Вторжение США в Панаму (кодовое название: Операция «Правое дело», англ. Operation Just Cause) происходило с декабря 1989 по январь 1990 года. США официально мотивировали вторжение необходимостью защиты жизни 35 тысяч американских граждан и восстановления демократии в Панаме.',
        },
        {
          date: 1991,
          description:
            'Распад СССР — прекращение существования Союза Советских Социалистических Республик вследствие процессов системной дезинтеграции, имевших место в социальной структуре, народном хозяйстве, общественно-политическом и государственном устройстве страны.',
        },
        {
          date: 1993,
          description:
            'Европейский союз (Евросоюз, ЕС) — экономическое, политическое и военное объединение 27 европейских государств.',
        },
        {
          date: 1997,
          description:
            'Киотский протокол — международное соглашение, заключённое с целью сокращения выбросов парниковых газов в атмосферу Земли для противодействия глобальному потеплению.',
        },
        {
          date: 1999,
          description:
            'Специальный административный район Макао был образован 20 декабря 1999 года в результате ликвидации португальской колонии Макао и стал одним из двух специальных административных районов КНР (вторым является Гонконг)',
        },
      ],
    },

    {
      ['science']: [
        {
          date: 1990,
          description:
            'Запуск космического телескопа Hubble, значительно раздвинувшего видимые горизонты .',
        },
        {
          date: 1991,
          description:
            'Первый в мире сайт info.cern.ch появился 6 августа . Его создатель, Тим Бернерс-Ли, опубликовал на нём описание новой технологии World Wide Web, основанной на протоколе передачи данных HTTP, системе адресации URI и языке гипертекстовой разметки HTML',
        },
        {
          date: 1995,
          description:
            'Windows 95  — графическая многозадачная операционная система корпорации Microsoft. Была выпущена к производству 14 июля и официально представлена 24 августа.Русская версия поступила в продажу 10 ноября.',
        },
        {
          date: 1996,
          description:
            'Овечка Долли  — первое клонированное млекопитающее животное, которое было получено путём пересадки ядра соматической клетки в цитоплазму яйцеклетки. Овца Долли являлась генетической копией овцы — донора клетки.',
        },
        {
          date: 2001,
          description: '«Марс Одиссей» вышел на орбиту Марса и приступил к работе ).',
        },
        {
          date: 2004,
          description:
            '«Кассини-Гюйгенс» достиг окрестностей Сатурна и приступил к работе. На поверхность Титана доставлен зонд «Гюйгенс».',
        },
      ],
    },

    {
      ['cinema']: [
        {
          date: 2000,
          description: '«Миссия невыполнима 2»/Mission Impossible 2, США (режиссёр Джон Ву)',
        },
        {
          date: 2001,
          description: '«Кокаин»/Blow, США, (реж. Тед Демме)',
        },
        {
          date: 2002,
          description: 'Властелин колец: Две крепости',
        },
        {
          date: 2003,
          description: '«Плохие парни 2»',
        },
        {
          date: 2004,
          description: '«Вокруг света за 80 дней»',
        },
        {
          date: 2003,
          description: '«Терминатор 3: Восстание машин»',
        },
      ],
    },

    {
      ['literature']: [
        {
          date: 1995,
          description: 'Харуки Мураками. «Хроники заводной птицы».',
        },
        {
          date: 1996,
          description: 'Мартин, Джордж Рэймонд Ричард. «Игра престолов».',
        },
        {
          date: 1999,
          description: 'Сорокин, Владимир Георгиевич. «Голубое сало» .',
        },
      ],
    },

    {
      ['sport']: [
        {
          date: 2000,
          description:
            '15 сентября — 1 октября  — XXVII Летние Олимпийские игры в Сиднее, Австралия.',
        },
        {
          date: 2002,
          description:
            '9—22 февраля — XIX Зимние Олимпийские игры в Солт-Лейк-Сити, штат Юта, США.',
        },
        {
          date: 2003,
          description: 'В Сен-Дени (Франция) открылся IX Чемпионат мира по лёгкой атлетике.',
        },
        {
          date: 2004,
          description: '13—29 августа — XXVIII Летние Олимпийские игры в Афинах, Греция.',
        },
        {
          date: 2005,
          description:
            'С 17 июня по 1 июля в Варшаве проходил личный чемпионат Европы по шахматам. Турнир проходил по швейцарской системе в 13 туров.',
        },
        {
          date: 1999,
          description:
            '5-й Чемпионат мира по хоккею с шайбой среди женских команд был организован Международной Федерацией хоккея для национальных сборных команд по хоккею с шайбой.',
        },
      ],
    },

    {
      ['accident']: [
        {
          date: 1993,
          description:
            'Террористический акт 26 февраля произошёл в подземном гараже Северной башни Всемирного торгового центра в Нью-Йорке. Взорвался заминированный грузовик, начинённый 606 кг нитрата мочевины и несколькими баллонами с водородом',
        },
        {
          date: 1994,
          description:
            'Крушение парома «Эстония» — морская катастрофа, произошедшая ночью 28 сентября. Паром находился в пути из Таллина в Стокгольм. На его борту было 803 пассажира и 186 членов экипажа.',
        },
        {
          date: 1995,
          description:
            'Зари́новая ата́ка в токийском метро́ (яп. 地下鉄サリン事件 Тикатэцу сарин дзикэн) — террористический акт с применением отравляющего вещества зарина, произошедший 20 марта  на станциях Касумигасэки и Нагататё.',
        },
        {
          date: 1997,
          description:
            'Катастрофа Ан-124 в Иркутске — крупная авиационная катастрофа, произошедшая в субботу 6 декабря. Транспортный самолёт Ан-124-100 566-го военно-транспортного авиаполка ВВС России выполнял рейс по маршруту Москва—Иркутск—Владивосток—Камрань, но во время вылета из Иркутска у него отказали 3 из 4 двигателей. ',
        },
      ],
    },
  ],
}
